//============================================================//
//*名　前	GameMain.cpp
//*内　容	メイン(軸となるところ)
//*日　付	2017.7.13
//*更　新	2017.7.13
//*制作者	N.Shibayama
//============================================================//
#include "GameMain.h"
#include "PlayScene.h"

//==========================================================//
//*内　容	コンストラクタ
//*引　数	なし
//*戻り値	なし
//==========================================================//
GameMain::GameMain(int width, int height) :Game(width, height)
{
	m_game = new Game(width, height);

	//	プレイシーンから
	m_sceneBase = new PlayScene(width, height);
}

//==========================================================//
//*内　容	初期化
//*引　数	なし
//*戻り値	なし
//==========================================================//
int GameMain::Initialize()
{
	m_game->Initialize();
	m_sceneBase->InitializeGame();
	return 0;
}

//==========================================================//
//*内　容	画面サイズ取得
//*引　数	なし
//*戻り値	なし
//==========================================================//
void GameMain::GetDefaultSize(int & width, int & height)
{
	m_game->GetDefaultSize(width, height);
}

//==========================================================//
//*内　容	更新や描画の作動
//*引　数	なし
//*戻り値	なし
//==========================================================//
void GameMain::Tick()
{
	//	更新
	m_game->Run();
	this->Update();
	//	描画
	m_game->Clear();
	m_game->Render();
	this->Render();
	m_game->Present();
}

//==========================================================//
//*内　容	更新
//*引　数	なし
//*戻り値	なし
//==========================================================//
void GameMain::Update()
{
	m_sceneBase->UpdateGame();
}

//==========================================================//
//*内　容	描画
//*引　数	なし
//*戻り値	なし
//==========================================================//
void GameMain::Render()
{
	m_sceneBase->RenderGame();
}
